<?php

return [

    // --------------------------------------------------------
    // Сниппеты
    // --------------------------------------------------------
    /**
     * Ключ - Идентификатор
     * Значение*строка - класс обработчик
     * Значение*массив - тонкая настройка:
     * * handler - класс обработчик
     * * mode - режим обнаружения тега:
     * * * single - строка вида {{tag}}
     * * * double - строка вида [tag] [/tag]
     */
    // --------------------------------------------------------

    'snippets' => [
        'year' => App\View\Components::class,
        'button' => [
            'handler' => App\View\Components::class,
            'searchMode' => 'single',
            'pattern' => '/[bd3*)]/'
        ],
    ],

    // --------------------------------------------------------
    // Пресеты
    // --------------------------------------------------------

    'presets' => [
        'post' => ['year', 'button']
    ],
];
